from langchain_core.prompts import ChatPromptTemplate

from sqlite.VectorService import vector_service

text = """
“殿下？”\n短暂的寂静之后，人声喧沸了起来。\n“她什么时候回来的？”\n“这哪里知道？竟没有一点消息？”\n“她……居然还活着。”\n宋侧叹了口气，他袖中的手不停颤抖，再难掩饰自己的恐惧与不安。\n宁小龄怔了一会，忽然恍然道：“难道是她？”\n宁长久问：“谁？”\n宁小龄立刻解释道：“传说皇宫之中，只说殿下便知其人的，不是太子皇子，也不是某位公主，而是……一个娘娘的养女。”\n宁长久愈发疑惑：“养女？”\n宁小龄点了点头：“相传十多年前，先帝亲征归来，于城楼遇到了一位神仙般的女子，他将这位女子接回宫，为其铸造大殿，奉为神子，而这个女子身边，据说跟着一个四五岁大的小丫头，有人说那是她和皇帝的私生女，有人说那是她收养的孤苦孩子，总之一并养于深宫之中，而十多年前……”\n宁小龄的声音压得更低了些：“十多年前，大殿刚刚落成，本当壮年的皇帝却染了重疾，最终不治身亡。”\n周围人声嘈杂，宁小龄说话间小心地看了看四周，确定没人注意自己才松了口气。\n宁长久想通了许多关节：“原来二十天前，死的便是那位娘娘。”\n宁小龄瞪大了眼，愣了片刻才听明白了他的话。\n民间对于那位久居深宫的娘娘有许多猜测，虽然很多人说她是祸害赵国国祚的妖女，先皇的暴死定与她脱不了干系，但是十余年间，谁又敢真正动她？\n这位娘娘虽从未露面，却在赵国留下了很多故事，譬如乾玉宫万里飞剑斩妖，九霄之外苍龙来朝……\n在赵国，那位娘娘不管是神是妖，都算是传说中的人物。\n所以她也并未往那个方向去想过。\n此刻宁长久一语点醒，她也一下豁然开朗，心道若死的真是那位娘娘，那作为她的女儿，那位殿下岂会善罢甘休？而这殿中众人神采各异，多是惊恐畏惧，想来娘娘的死与他们都脱不了干系。\n难怪这般害怕……\n宁长久道：“哪怕如此，他们为何害怕？既然敢杀那位娘娘，女儿为何不一并杀了？”\n宁小龄连忙扯了扯他的袖子，示意他别说了。\n所幸也没有人注意他，因为外面隐约有个绰约人影穿过雨幕走了过来，人声渐渐安静。\n宁长久立在门扉后的阴影里，望了过去。\n秋雨清冷，落木萧萧，青黄参半的院子里，雪白裙裳，纤腰束带的少女支着古旧红伞缓缓走来。\n她走过石阶，于檐下收伞，少女握伞似提剑腰间，水滴自尖细的伞头滴落，一声声清晰可闻。\n她环顾了一圈殿内的众人，最后落到了宋侧的身，少女抿了抿唇，微微一笑：\n“诸位……别来无恙？”\n话语间恰好阴云开裂，一束天光漏下，越过茫茫秋雨落在了她的身。\n她此刻立在檐下，半身是光半身是影。\n众人这才一一反应过来，纷纷行礼，恭敬地说着参见殿下。\n事实，除了三年前那的一天，之后很少再有人见过她，今日一见，才知三年前那个在乾玉殿下阶前立血的野丫头，如今竟已长成这般模样了。\n宁小龄怔怔地看了她一会，很快收回了目光，低下了头，心脏砰砰得跳着。\n宁长久看了她一眼，同样微微失神。\n少女生得极美，未施粉黛却眉目如画，素衣白裙却动人心魄。\n宁长久看着她，似看着一朵黑白墨色的花，纤细成开在峭壁悬崖，于是万物失了光彩，只剩下纯净的黑与白。\n少女对了宁长久的目光。\n宁长久平静地看着她，目光却没有丝毫的闪躲与避让。\n秋雨连连，寒风入殿，官员们依然躬身低头，神像前那座焦黑的尸体混杂着腐烂与烧焦的难闻气味，一片诡异的安静里，他们的视线便如此交汇着。\n宁长久觉得她有些熟悉，追溯记忆，却怎么也想不起在何时见过。\n或许只是少女生得太美，在他道心溅起了涟漪，如今他终究是凡夫俗子的身躯，自然躲不过人间的七情六欲。\n宁小龄不安地看着他们，鼓起勇气向前走了一步，行礼道：“参见殿下，我与师兄随师父一道来降魔，师父不幸身死，师兄近来神思有些古怪，还望殿下莫要怪罪。”\n宁长久稍稍回神，想起了这些世俗王朝的礼节，有些笨拙地行了一礼：“见过殿下。”\n少女微微一笑，清清冷冷的声音犹带几分稚气：“既是来宫中除妖，便是客人，我本就不喜这些繁文缛节，哪有怪罪之理？”\n宁小龄退回了宁长久的身侧，稍稍松了口气。\n“诸位见到我……”少女眸子微眯，轻声笑道：“为何神色这般悲痛？”\n众人回过神，连忙纷纷跪下，直呼不敢。\n少女抬了抬手，示意他们起身：“我刚才说了，我不喜这些繁文缛节。”\n有些人立了起来，却发现其他人依旧跪着，便又跪了下去。\n少女目光缓缓扫视过四周，她叹了口气，声音却愈发冷淡：“诸位不愿起，可是心里有鬼？”\n众人视线偷偷交汇，无人应声。\n而这些人中，宋侧官职最大，雀鬼的调查一事，也主要由他调查。\n他轻声叹气，首先起身，看着眼前白裙微摆，墨发披肩的少女，道：“殿下能平安回来，自是好事，我等……喜不自胜。”\n“呵……”\n少女笑了起来，她的嘴唇血色极淡，薄而微翘，此刻轻轻勾起，眉目也随之生动，她向前走了两步，便似从画卷中走出，来到了众人之间。\n“二十天前，铁骑围宫，曾在殿前宣誓效忠娘亲的宋大人，当时在何处？”\n宋侧冷汗淋漓：“那日……那日太过混乱，满城皆是火光血光，在下也不知该如何是好啊。”\n“不知如何是好？”少女面容柔美，神色却愈发冷厉。\n宋侧闭了眼，不敢作答。\n少女盯着他，语气陡然露出锋芒：“围宫，放火，杀人，铁骑踏殿……蓄谋这么久，竟成了一句不知如何是好？你们可真是……胆大包天啊。”\n宋侧悲道：“大势如此，宋某绵薄之力能作为何？”\n少女冷漠地看着他，沉默了一户，问：“为什么？”\n宋侧深深地礼了一身，随后一点点地挺直了自己的身子，尽力看着她的眼睛，道：“如果娘娘不一直久居深宫，如果她能多看两眼人间的苦难，听听万民的请愿，这一切，又何至于此？”\n少女道：“娘亲始终注视着赵国。”\n宋侧悲痛道：“可苍生不知，我亦不知啊……”\n少女道：“你们知不知，娘亲不在乎。”\n宋侧盯着少女那稚美绝伦的脸，问道：“那殿下呢？殿下在乎吗？”\n少女没有回答，平静地看着他，等待着他继续说话。\n宋侧喟然长叹，眼神愈发坚定：“赵国国运已凋敝至此，前与瑨国战，大军节节败退，后有荣国虎视眈眈，割让国土无算，如今亡国之兆已现其形，瑨国又三番五次放出那种话，殿下久居深宫，不知我等日日夜夜都是承受着何等煎熬！如今事已至此，宋某有恨无悔，只求一死，还望殿下可以收手……”\n“收手？”少女秀眉一蹙，旋即指着地那具焦黑尸体，笑道：“你以为，他们是我杀的？”\n宋侧低头不语。\n少女平静道：“我何时回宫，昨夜又在何处，以宋大人的耳目，不难知晓吧？”\n宋侧沉默了一会，点了点头，沉声道：“知道……昨夜殿下在乾玉殿前，跪了一整夜。”\n这是许多人都知道的事情，只是杀人者除了是她，还能是谁？难道真是那虚无缥缈的雀鬼？只是她在乾玉殿前跪了一夜，如何又能杀人？\n少女不再多说，直截了当道：“我娘亲的尸身呢？”\n宋侧答道：“不曾找到。”\n“嗯？”少女轻轻挑眉。\n宋侧叹息道：“但我确定，那日乾玉殿中，一个人都没有逃出来。”\n大火铁骑弓箭法阵，加那位神灵的出手，插翅难逃。\n少女不再说话，缓缓抬起了手，那修长而雪白的手指自宽大的衣袖间探出，显得愈发纤细。\n那双手搭在了宋侧的肩。\n宋侧浑身僵硬，浑身冷汗淋漓却不敢动弹。\n众人看到这一幕，不由自主地想起了三年前，乾玉殿前，那个娇小的小姑娘浑身是血却面不改色的模样。\n宋侧闭了眼，已心存死志。\n少女却只是笑了笑，替他理了理衣衫，微笑道：“宋大人可要好好珍惜这身来之不易的官服。”\n宋侧愣住了，他还没反应过来自己是从鬼门关走了一遭，身子依旧紧紧地绷着。\n少女不再看他，视线望向了其余众人，她笑了笑，道：“我便在国师府中，诸位若有事商议，尽管来寻便是。”\n“国师府？”宋侧目光微异。\n少女已转身向外走去。\n檐外秋雨未停，她重新支起了伞，声音透过雨幕清冷传来：\n“先生重病垂危，做学生的，自当尽心服侍。”\n微风徐来，臂侧的裙衫，一朵黄色小花在风中飘摇。\n……\n……\n“国师府？她怎么会去国师府？”\n“国师是她的先生，如今也算是她唯一的亲人，可是二十天前那场围杀，国师可是选择了袖手旁观啊……”\n“她会不会还不知道自己老师已站在了她的对面？”\n“有此可能。”\n“对了，那些刺客呢？瑨国派出截杀她的刺客呢？为什么她还是回来了？”\n“难道是失手了……怎么会，据说瑨国排名第三的刺客都出手了，哪会无功而返？”\n“看来只能看国师与巫主大人了，这势不同水火的两人可是难得一心，那小丫头除非有通天本事，要不然定和她娘亲一个下场！”\n众人议论纷纷，大抵也算是往好的方面想，一个声音却突兀响起。\n“你们是真的不明白？那位姑娘的话语，不是摆明了已经挟持了国师么？”\n众人循着说话声望去，只见一个穿着道袍的少年疑惑地望着他们，像是在看一群傻子。\n许多人回想起那少女方才的话，心中恍然，但他们心中本就憋屈非凡，如今又被一个少年点破，脸多是怒容。\n宋侧忍无可忍，厉声喝道：“你究竟想做什么？这里用不着你们，给我滚出城去，再敢多嘴，那笔你师父的安葬费，一分可都不给了！”\n宁长久无奈地看着他，心想明明是自己好意提醒，为何此人这般不领情？\n这便是山下的世俗世界么？\n宁小龄扯了扯他的袖子，近乎央求道：“师兄，我们走吧……”\n宋侧此刻心情极差，再懒废话，摆了摆手，示意侍卫将他们押出去。\n“等一等！”\n人群中忽然有人走了出来。\n宋侧看了那人一眼，不悦道：“赵石松，你来添什么乱子？”\n那名为赵石松的人讨饶般拱了拱手，随后望向了那对少年少女，试探性问道：“不知小道长道法如何？”\n宁长久道：“尚可。”\n赵石松想了想，道：“实不相瞒，近来家中夫人亦染了煞气，名医请了道士也叫了，却都束手无策，不知你们可愿试试？”\n显然他是要死马当活马医了。\n宋侧刚想斥责，宁长久却已抢先开口：“可以。”\n宁小龄被逼无奈，只好假装自信地点了点头。\n宋侧看了他们一眼，不再劝阻，拂袖离去，眼神愈发淡漠。
"""
system = """
【角色定义】：你是一位资深的内容分析专家、文学评论家和心理学专家。
【任务目标】：从下述‘原文片段’中总结‘关键信息’，用于片段关键内容召回检索。
"""
user = """
【原文片段】
{original_text}
"""
user = user.replace("{original_text}", text)
# 调用模型进行关键信息召回内容检索
template = ChatPromptTemplate.from_messages([
    ("system", system),
    ("user", user)
])
test_chain = (

)

results = vector_service.search(f"请检索出与下述文本片段相关内容："
                      f"{text}", k=10)
print(results)